<template>
  <main>
    <div class="container">  
      <h1>隐私条款</h1>  
      <h2>尊重您的隐私，守护您的数据安全</h2>  
      <p>欢迎访问本网站！我们深知您的隐私和数据安全至关重要，特此制定以下隐私条款，旨在向您明确说明我们如何保护您的个人信息及文件数据。请您仔细阅读以下内容，以便更好地了解我们的隐私政策。</p>  

      <h3>一、隐私信息收集</h3>  
      <p>我们承诺，除非您自愿提供，否则我们不会主动收集您的任何隐私信息。在您使用我们的网站时，我们可能会收集一些非个人化的数据，如IP地址等，但这些数据仅用于优化我们的网站服务，提升用户体验，且不会与您的个人身份相关联。</p>  

      <h3>二、用户文件保管</h3>  
      <ul>  
          <li>  
            <strong>严格保密</strong>：我们深知用户上传的文件包含敏感信息，因此，我们采取了一系列严格的安全措施来保护您的文件数据。您的文件在上传后，只有您自己能够访问到该文件。  
          </li>  
          <li>  
            <strong>用户自主控制</strong>：我们允许您随时下载、分享（分享链接）和取消分享自己的文件。请注意，一旦您分享了文件，被分享者将能够访问您的文件。因此，请务必谨慎分享。  
          </li>  
          <li>  
            <strong>数据备份</strong>：我们对数据进行一式两份的备份，以防止数据丢失。但请注意，尽管我们采取了预防措施，但无法完全保证数据的绝对可用。因此，建议您自行下载保存。  
          </li>  
      </ul>  

      <h3>三、最终解释权</h3>  
      <p>本隐私条款的最终解释权归我们所有。我们保留在必要时对本条款进行修订的权利。一旦条款发生修订，我们将在网站上发布更新后的版本，并通过适当的方式通知您。请您定期查看本隐私条款，以确保您了解最新的隐私政策。</p>  

      <h3>四、联系我们</h3>  
      <div class="contact-info">  
          <p>如果您对我们的隐私条款有任何疑问或建议，或需要了解更多关于我们如何处理您的个人信息及文件数据的信息，请随时通过以下方式与我们联系：</p>  
          <ul>
            <li>电子邮件：<a href="mailto:19950083014@163.com">19950083014@163.com</a></li>  
            <li>微信：<a href="tel:15891653276">15891653276</a></li>   
          </ul>  
      </div>  

      <p>我们致力于为您提供安全、可靠、便捷的服务。您的信任和支持是我们不断前进的动力。感谢您选择我们的网站，祝您使用愉快！</p>  
    </div>  
  </main>
</template>
<style scoped>
h1, h2, h3 {  
  color: #2bc6ff;  
}  
main{  
  font-family: Arial, sans-serif;  
  line-height: 1.6;  

  color: #c8c8c8;  
  max-width: 800px;  
  margin: 0 auto;  
  background: #444444;  
  padding: 20px;  
  box-shadow: 0 0 10px rgba(0,0,0,0.1);  
}  
ul {  
  list-style-type: none;  
  padding: 0;  
}  
ul li {  
  margin-bottom: 10px;  
}  
.contact-info {  
  margin-top: 20px;  
}  
</style>